# Коллекции данных
#  Списки - упорядочный конечный набор элементов.
# List_1 = [] #создаем пустой спислк
# list_1 = list() # так же создаем пустой список
# print(list_1) # выведет список с квадратными скобками и запятыми.
# print(*list_1) # звездочка обозначает, что мы хотим вывести список без пунктуации и звездочек
# list_1 = [1, 2, 6, 2]
# print(*List_1)
# for i in list_1:
#     print(i)

# print(len(list_1)) - вывести длинну списка

# list_1 = [1, 5]
# print(list_1)
# list_1.append(85)  # добавляет в конце списка 
# print(list_1)

# list_1 = []
# print(list_1)
# for i in range(5):
#     list_1.append(i)
#     print(list_1)

# удаление последнее значение списка
# list_1 = [12, 7, -1, 21, 0]
# a = list_1.pop
# print(list_1.pop()) # 0
# print(list_1) #[12, 7, -1, 21]
# print(list_1.pop()) # 21
# print(list_1) #[12, 7, -1]
 
# print(list_1.pop(0)) # 12
# print(list_1) #[7, -1, 21, 0]

# добавление элемента на нужную позицию
# list_1 = [12, 7, -1, 21, 0]
# print(list_1.insert(2,11))
# print(list_1)  #[12, 7, 11, -1, 21, 0]

# list_1 = [1, 2, 3, 4, 5, 6,7]

# кОРТЕЖИ - это неизменяемый список
# t = ()

# print(type(t))

# t = (1, ) #чтобы сохранялся класс кортеж

# print(type(t))

# v = [1, 8, 9]
# print(v)

# v = tuple(v)
# print(v)
# print(type(v))

# множественное присваивание
# a, b = 1, 2
# a = b = 1

#  Словари - неупорядоченные коллекции произвольных объектов с доступом по ключу.
# в списках вместо ключа используется индекс элемента. 
# в словаре для определения элемента используется значение ключа(строка, число)

# dictionary = {}

# # d = {} or d = dict()
# d = {}
# d['q'] = 'qwerty'
# print(d)
# d['w'] = 'werty'
# print(d)

# print(d['q'])

# Множества содержат в себе уникальные элементы, не обязательно упорядоченные.




  
